import numpy as np

# =======================
#  ДАННЫЕ ИЗ ТАБЛИЦЫ
# =======================

y = np.array([
    30.8, 31.2, 33.2, 35.6, 36.7, 39.2, 40.3, 40.4, 41.8, 40.4,
    40.7, 40.4, 41.7, 44.1, 46.7, 50.6, 50.1, 52.9
])

x1 = np.array([
    459.7, 492.9, 528.6, 560.0, 666.4, 772.6, 843.3, 911.6, 1021.5, 1165.9,
    1349.6, 1449.4, 1575.5, 1759.1, 1994.2, 2258.1, 2478.7
])

x2 = np.array([
    39.0, 37.3, 38.1, 39.3, 37.6, 38.4, 38.2, 39.7, 52.1, 58.3,
    57.9, 56.5, 63.7, 61.6, 58.9, 66.4, 70.4
])

x3 = np.array([
    55.3, 54.7, 63.7, 69.8, 65.9, 64.5, 73.2, 79.1, 95.4, 123.5,
    129.9, 117.6, 130.9, 129.8, 128.0, 141.0, 168.2
])

x4 = np.array([
    79.2, 77.4, 80.2, 80.4, 83.9, 85.5, 106.1, 114.0, 124.1, 142.9,
    143.6, 139.2, 165.5, 203.3, 219.6, 221.6, 232.6
])

# =======================
#    МОНТЕ-КАРЛО РЕГРЕССИЯ
# =======================

ln_y = np.log(y)
ln_x1 = np.log(x1)
ln_x2 = np.log(x2)
ln_x3 = np.log(x3)

N = 300_000

best_sse = float("inf")
best = None

for _ in range(N):
    A  = np.random.uniform(-10, 10)
    B1 = np.random.uniform(-5, 5)
    B2 = np.random.uniform(-5, 5)
    B3 = np.random.uniform(-5, 5)

    pred = A + B1 * ln_x1 + B2 * ln_x2 + B3 * ln_x3
    sse = np.sum((ln_y - pred)**2)

    if sse < best_sse:
        best_sse = sse
        best = (A, B1, B2, B3)

A, B1, B2, B3 = best

beta0 = np.exp(A)

print("\n=== РЕЗУЛЬТАТЫ МОДЕЛИ ===")
print(f"y = {beta0:.5f} * x1^{B1:.5f} * x2^{B2:.5f} * x3^{B3:.5f}")
print("SSE =", best_sse)
